module.exports.FONTS_RUSSIAN = [
    {
        lowercase: 'ᴀбʙᴦдᴇёжɜийᴋᴧʍнᴏᴨᴩᴄᴛуɸхцчɯщъыь϶юя',
        uppercase: 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
    },
    {
        lowercase: 'ⲁⳝⲃⲅⲇⲉⲉⲯⳅυύⲕⲗⲙⲏⲟⲡⲣⲥⲧⲩⲫⲭцⳡⲱⳃъыьэюя',
        uppercase: 'ⲀⳜⲂⲄⲆⲈⲈⲮⳄⳘЙⲔⲖⲘⲎⲞⲠⲢⲤⲦⲨⲪⲬЦⳠⲰⳂЪЫЬЭЮЯ',
    },
    {
        lowercase: 'ልፔፎታሏይይሦንሀህኸበጠዘዐከየርፐነዋጰህሃሠሡሪፊሪጓሬጸ'
    },
    {
        lowercase: 'ℷཏཋ۲ℶ٤٤ᜈ༣༥༥۴۸ཀℵ٥กཥངᜎལཆ྾པལཡཔเ༁เཟཁཐ'
    },
    {
        lowercase: 'ꁲꃥꃃ꒕ꅓꂅꂅꁘ꒱ꈤꈣꂪꀊꂵꍬꏿꊮꉣꊐꉢꌦꂈꉧꈥꃏꅐꁁꋍꎪꋍꎪꎆꂼꋪ'
    },
    {
        lowercase: 'ᚣƃᛒᛚᚦᛊᛊᛯƷᛋᛪᛕᚳᛖᚺᛜᚢᚹᛈᛠᚴᛰᚷᛮⰍᚠᚡᚦᚦᚦᛘᛜᛟ'
    },
    {
        lowercase: 'ѦⵒɃⵤⵠⵟⵟⵅᕒⵍⵍҞⴷᗑⴼⵔगᎮⵎⵜᖿⵀⵋⵡⵖᗐƜѣѣѣⴺⵚⴳꯌ'
    },
    {
        lowercase: 'ᗣᘜᙖᒋᗪᙓᙓᙧᙐᑌᕫᏦᙁᗰᕼᗝᑎᖘᙅᙢᎽᙨⵋᘈᔦᗯᘺᖚᕠᖚᑓᕡᖆꯌ'
    },
    {
        lowercase: 'ѧѣʙґđєєѫӡџӣκʌʍʜѳπⱀҁϯƴѻχҵӌɯѱƀƀƀ϶ѥᴙ',
        uppercase: 'ѦѢƁҐДΣΣѪӠЏӢҞΛᛖⴼѲ∏ƤҀϮƳѺӼҴӋƜѰƀƀƀƎѤЯꯌꯌ'
    }
];

module.exports.FONTS_ENGLISH = [
    {
        lowercase: ['ᵃ', 'ᵇ', 'ᶜ', 'ᵈ', 'ᵉ', 'ᶠ', 'ᵍ', 'ʰ', 'ⁱ', 'ʲ', 'ᵏ', 'ˡ', 'ᵐ', 'ⁿ', 'ᵒ', 'ᵖ', 'q', 'ʳ', 'ˢ', 'ᵗ', 'ᵘ', 'ᵛ', 'ʷ', 'ˣ', 'ʸ', 'ᶻ'],
        uppercase: ['ᴬ', 'ᴮ', 'ᶜ', 'ᴰ', 'ᴱ', 'ᶠ', 'ᴳ', 'ᴴ', 'ᴵ', 'ᴶ', 'ᴷ', 'ᴸ', 'ᴹ', 'ᴺ', 'ᴼ', 'ᴾ', 'Q', 'ᴿ', 'ˢ', 'ᵀ', 'ᵁ', 'ⱽ', 'ᵂ', 'ˣ', 'ʸ', 'ᶻ']
    },
    {
        lowercase: ['𝚊', '𝚋', '𝚌', '𝚍', '𝚎', '𝚏', '𝚐', '𝚑', '𝚒', '𝚓', '𝚔', '𝚕', '𝚖', '𝚗', '𝚘', '𝚙', '𝚚', '𝚛', '𝚜', '𝚝', '𝚞', '𝚟', '𝚠', '𝚡', '𝚢', '𝚣'],
        uppercase: ['𝙰', '𝙱', '𝙲', '𝙳', '𝙴', '𝙵', '𝙶', '𝙷', '𝙸', '𝙹', '𝙺', '𝙻', '𝙼', '𝙽', '𝙾', '𝙿', '𝚀', '𝚁', '𝚂', '𝚃', '𝚄', '𝚅', '𝚆', '𝚇', '𝚈', '𝚉']
    },
    {
        lowercase: ['𝔞', '𝔟', '𝔠', '𝔡', '𝔢', '𝔣', '𝔤', '𝔥', '𝔦', '𝔧', '𝔨', '𝔩', '𝔪', '𝔫', '𝔬', '𝔭', '𝔮', '𝔯', '𝔰', '𝔱', '𝔲', '𝔳', '𝔴', '𝔵', '𝔶', '𝔷'],
        uppercase: ['𝔄', '𝔅', 'ℭ', '𝔇', '𝔈', '𝔉', '𝔊', 'ℌ', 'ℑ', '𝔍', '𝔎', '𝔏', '𝔐', '𝔑', '𝔒', '𝔓', '𝔔', 'ℜ', '𝔖', '𝔗', '𝔘', '𝔙', '𝔚', '𝔛', '𝔜', 'ℨ']
    },
    {
        lowercase: ['𝕒', '𝕓', '𝕔', '𝕕', '𝕖', '𝕗', '𝕘', '𝕙', '𝕚', '𝕛', '𝕜', '𝕝', '𝕞', '𝕟', '𝕠', '𝕡', '𝕢', '𝕣', '𝕤', '𝕥', '𝕦', '𝕧', '𝕨', '𝕩', '𝕪', '𝕫'],
        uppercase: ['𝔸', '𝔹', 'ℂ', '𝔻', '𝔼', '𝔽', '𝔾', 'ℍ', '𝕀', '𝕁', '𝕂', '𝕃', '𝕄', 'ℕ', '𝕆', 'ℙ', 'ℚ', 'ℝ', '𝕊', '𝕋', '𝕌', '𝕍', '𝕎', '𝕏', '𝕐', 'ℤ']
    },
    {
        lowercase: ['𝒶', '𝒷', '𝒸', '𝒹', '𝑒', '𝒻', '𝑔', '𝒽', '𝒾', '𝒿', '𝓀', '𝓁', '𝓂', '𝓃', '𝑜', '𝓅', '𝓆', '𝓇', '𝓈', '𝓉', '𝓊', '𝓋', '𝓌', '𝓍', '𝓎', '𝓏'],
        uppercase: ['𝒜', '𝐵', '𝒞', '𝒟', '𝐸', '𝐹', '𝒢', '𝐻', '𝐼', '𝒥', '𝒦', '𝐿', '𝑀', '𝒩', '𝒪', '𝒫', '𝒬', '𝑅', '𝒮', '𝒯', '𝒰', '𝒱', '𝒲', '𝒳', '𝒴', '𝒵']
    }
];

module.exports.RUSSIAN = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя';
module.exports.ENGLISH = 'abcdefghijklmnopqrstuvwxyz';

module.exports.PANGRAM_RUSSIAN = 'В чащах юга жил бы цитрус? Да, но фальшивый экземпляр!';
module.exports.PANGRAM_ENGLISH = 'Sphinx of black quartz, judge my vow.';